Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/edc/PIC32CX2051MTC128S1.PIC
      <edc:AdjustPoint edc:offset="0x30" edc:_addr="0x40004260"/>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM1" edc:cname="FLEX_US_CMPR" edc:nzwidth="0x20" edc:access="-------nnnnnnnnn-nnn---nnnnnnnnn" edc:impl="0x1FF71FF" edc:_addr="0x40004290">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM1">
            <edc:SFRFieldDef edc:cname="VAL1" edc:nzwidth="0x9" edc:desc="First Comparison Value for Received Character"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CMPMODE" edc:nzwidth="0x2" edc:desc="Comparison Mode">
              <edc:SFRFieldSemantic edc:cname="FLAG_ONLY" edc:desc="Any character is received and comparison function drives CMP flag." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="START_CONDITION" edc:desc="Comparison condition must be met to start reception." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FILTER" edc:desc="Comparison must be met to receive the current data only" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMPPAR" edc:nzwidth="0x1" edc:desc="Compare Parity"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VAL2" edc:nzwidth="0x9" edc:desc="Second Comparison Value for Received Character"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40004294"/>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM1" edc:cname="FLEX_US_FMR" edc:nzwidth="0x20" edc:access="--nnnnnn--nnnnnn--nnnnnnn-nn--nn" edc:impl="0x3F3F3FB3" edc:_addr="0x400042A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM1">
            <edc:SFRFieldDef edc:cname="TXRDYM" edc:nzwidth="0x2" edc:desc="Transmitter Ready Mode">
              <edc:SFRFieldSemantic edc:cname="ONE_DATA" edc:desc="TXRDY will be at level '1' when at least one data can be written in the transmit FIFO. When DMA is enabled to transfer data and FLEX_US_MR.MODE9=0 (up to 8 bits to transfer on the line), the chunk of 1 byte must be configured in the DMA. If the transfer is performed by software, the access type must be defined as a byte." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TWO_DATA" edc:desc="TXRDY will be at level '1' when at least two data can be written in the transmit FIFO. To minimize system bus load, when DMA is enabled to transfer data and FLEX_US_MR.MODE9=0 (up to 8 bits to transfer on the line), the chunk of 1 halfword (1 halfword carries 2 bytes) must be configured in the DMA. If the transfer is performed by software, the access type can be defined as byte (1 byte per access, 2 accesses) or halfword (2 bytes per access, 1 single access)." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FOUR_DATA" edc:desc="TXRDY will be at level '1' when at least four data can be written in the transmit FIFO. To minimize system bus load, when DMA is enabled to transfer data and FLEX_US_MR.MODE9=0 (up to 8 bits to transfer on the line), the chunk of 1 word (1 word carries 4 bytes) must be configured in the DMA (chunk size=1 and word access). If the transfer is performed by software, the access type can be defined as byte (1 byte per access, 4 accesses), halfword (2 bytes per access, 2 accesses) or word (4 bytes per access, 1 single access)." edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXRDYM" edc:nzwidth="0x2" edc:desc="Receiver Ready Mode">
              <edc:SFRFieldSemantic edc:cname="ONE_DATA" edc:desc="RXRDY will be at level '1' when at least one unread data is in the receive FIFO. When DMA is enabled to transfer data and FLEX_US_MR.MODE9=0 (up to 8 bits to transfer on the line), the chunk of 1 byte must be configured in the DMA. If the transfer is performed by software, the access type must be defined as a byte." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TWO_DATA" edc:desc="RXRDY will be at level '1' when at least two unread data are in the receive FIFO. To minimize system bus load, when DMA is enabled to transfer data and FLEX_US_MR.MODE9=0 (up to 8 bits to transfer on the line), the chunk of 1 halfword (1 halfword carries 2 bytes) must be configured in the DMA (chunk size=1 and halfword access). If the transfer is performed by software, the access type can be defined as byte (1 byte per access, 2 accesses) or halfword (2 bytes per access, 1 single access)." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FOUR_DATA" edc:desc="RXRDY will be at level '1' when at least four unread data are in the receive FIFO. To minimize system bus load, when DMA is enabled to transfer data and FLEX_US_MR.MODE9=0 (up to 8 bits to transfer on the line), the chunk of 1 word (1 word carries 4 bytes) must be configured in the DMA. If the transfer is performed by software, the access type can be defined as byte (1 byte per access, 4 accesses), halfword (2 bytes per access, 2 accesses) or word (4 bytes per access, 1 single access)." edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FRTSC" edc:nzwidth="0x1" edc:desc="FIFO RTS Pin Control enable (Hardware Handshaking mode only)"/>
            <edc:SFRFieldDef edc:cname="TXFTHRES" edc:nzwidth="0x6" edc:desc="Transmit FIFO Threshold"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXFTHRES" edc:nzwidth="0x6" edc:desc="Receive FIFO Threshold"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXFTHRES2" edc:nzwidth="0x6" edc:desc="Receive FIFO Threshold 2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM1" edc:cname="FLEX_US_FLR" edc:nzwidth="0x20" edc:access="----------rrrrrr----------rrrrrr" edc:impl="0x3F003F" edc:_addr="0x400042A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM1">
            <edc:SFRFieldDef edc:cname="TXFL" edc:nzwidth="0x6" edc:desc="Transmit FIFO Level"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="RXFL" edc:nzwidth="0x6" edc:desc="Receive FIFO Level"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM1" edc:cname="FLEX_US_FIER" edc:nzwidth="0x20" edc:access="----------------------w-wwwwwwww" edc:impl="0x2FF" edc:_addr="0x400042A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM1">
            <edc:SFRFieldDef edc:cname="TXFEF" edc:nzwidth="0x1" edc:desc="TXFEF Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXFFF" edc:nzwidth="0x1" edc:desc="TXFFF Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXFTHF" edc:nzwidth="0x1" edc:desc="TXFTHF Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXFEF" edc:nzwidth="0x1" edc:desc="RXFEF Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXFFF" edc:nzwidth="0x1" edc:desc="RXFFF Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXFTHF" edc:nzwidth="0x1" edc:desc="RXFTHF Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXFPTEF" edc:nzwidth="0x1" edc:desc="TXFPTEF Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXFPTEF" edc:nzwidth="0x1" edc:desc="RXFPTEF Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXFTHF2" edc:nzwidth="0x1" edc:desc="RXFTHF2 Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM1" edc:cname="FLEX_US_FIDR" edc:nzwidth="0x20" edc:access="----------------------w-wwwwwwww" edc:impl="0x2FF" edc:_addr="0x400042AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM1">
            <edc:SFRFieldDef edc:cname="TXFEF" edc:nzwidth="0x1" edc:desc="TXFEF Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXFFF" edc:nzwidth="0x1" edc:desc="TXFFF Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXFTHF" edc:nzwidth="0x1" edc:desc="TXFTHF Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXFEF" edc:nzwidth="0x1" edc:desc="RXFEF Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXFFF" edc:nzwidth="0x1" edc:desc="RXFFF Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXFTHF" edc:nzwidth="0x1" edc:desc="RXFTHF Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXFPTEF" edc:nzwidth="0x1" edc:desc="TXFPTEF Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXFPTEF" edc:nzwidth="0x1" edc:desc="RXFPTEF Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXFTHF2" edc:nzwidth="0x1" edc:desc="RXFTHF2 Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM1" edc:cname="FLEX_US_FIMR" edc:nzwidth="0x20" edc:access="----------------------r-rrrrrrrr" edc:impl="0x2FF" edc:_addr="0x400042B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM1">
            <edc:SFRFieldDef edc:cname="TXFEF" edc:nzwidth="0x1" edc:desc="TXFEF Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXFFF" edc:nzwidth="0x1" edc:desc="TXFFF Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXFTHF" edc:nzwidth="0x1" edc:desc="TXFTHF Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXFEF" edc:nzwidth="0x1" edc:desc="RXFEF Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXFFF" edc:nzwidth="0x1" edc:desc="RXFFF Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXFTHF" edc:nzwidth="0x1" edc:desc="RXFTHF Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXFPTEF" edc:nzwidth="0x1" edc:desc="TXFPTEF Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXFPTEF" edc:nzwidth="0x1" edc:desc="RXFPTEF Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXFTHF2" edc:nzwidth="0x1" edc:desc="RXFTHF2 Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM1" edc:cname="FLEX_US_FESR" edc:nzwidth="0x20" edc:access="----------------------rrrrrrrrrr" edc:impl="0x3FF" edc:_addr="0x400042B4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM1">
            <edc:SFRFieldDef edc:cname="TXFEF" edc:nzwidth="0x1" edc:desc="Transmit FIFO Empty Flag (cleared by writing the FLEX_US_CR.RSTSTA bit)"/>
            <edc:SFRFieldDef edc:cname="TXFFF" edc:nzwidth="0x1" edc:desc="Transmit FIFO Full Flag (cleared by writing the FLEX_US_CR.RSTSTA bit)"/>
            <edc:SFRFieldDef edc:cname="TXFTHF" edc:nzwidth="0x1" edc:desc="Transmit FIFO Threshold Flag (cleared by writing the FLEX_US_CR.RSTSTA bit)"/>
            <edc:SFRFieldDef edc:cname="RXFEF" edc:nzwidth="0x1" edc:desc="Receive FIFO Empty Flag (cleared by writing the FLEX_US_CR.RSTSTA bit)"/>
            <edc:SFRFieldDef edc:cname="RXFFF" edc:nzwidth="0x1" edc:desc="Receive FIFO Full Flag (cleared by writing the FLEX_US_CR.RSTSTA bit)"/>
            <edc:SFRFieldDef edc:cname="RXFTHF" edc:nzwidth="0x1" edc:desc="Receive FIFO Threshold Flag (cleared by writing the FLEX_US_CR.RSTSTA bit)"/>
            <edc:SFRFieldDef edc:cname="TXFPTEF" edc:nzwidth="0x1" edc:desc="Transmit FIFO Pointer Error Flag"/>
            <edc:SFRFieldDef edc:cname="RXFPTEF" edc:nzwidth="0x1" edc:desc="Receive FIFO Pointer Error Flag"/>
            <edc:SFRFieldDef edc:cname="TXFLOCK" edc:nzwidth="0x1" edc:desc="Transmit FIFO Lock"/>
            <edc:SFRFieldDef edc:cname="RXFTHF2" edc:nzwidth="0x1" edc:desc="Receive FIFO Threshold Flag 2 (cleared by writing the FLEX_US_CR.RSTSTA bit)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
