Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/edc/PIC32CX2051MTC128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM7" edc:cname="FLEX_SPI_SR" edc:nzwidth="0x20" edc:access="rrrrrrrr-------r---rrrrrrrrrrrrr" edc:impl="0xFF011FFF" edc:_addr="0x4001C410">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM7">
            <edc:SFRFieldDef edc:cname="RDRF" edc:nzwidth="0x1" edc:desc="Receive Data Register Full (cleared by reading FLEX_SPI_RDR)"/>
            <edc:SFRFieldDef edc:cname="TDRE" edc:nzwidth="0x1" edc:desc="Transmit Data Register Empty (cleared by writing FLEX_SPI_TDR)"/>
            <edc:SFRFieldDef edc:cname="MODF" edc:nzwidth="0x1" edc:desc="Mode Fault Error (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="OVRES" edc:nzwidth="0x1" edc:desc="Overrun Error Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of RX Buffer (cleared by writing FLEX_SPI_RCR or FLEX_SPI_RNCR)"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of TX Buffer (cleared by writing FLEX_SPI_TCR or FLEX_SPI_TNCR)"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="RX Buffer Full (cleared by writing FLEX_SPI_RCR or FLEX_SPI_RNCR)"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="TX Buffer Empty (cleared by writing FLEX_SPI_TCR or FLEX_SPI_TNCR)"/>
            <edc:SFRFieldDef edc:cname="NSSR" edc:nzwidth="0x1" edc:desc="NSS Rising (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Transmission Registers Empty (cleared by writing FLEX_SPI_TDR)"/>
            <edc:SFRFieldDef edc:cname="UNDES" edc:nzwidth="0x1" edc:desc="Underrun Error Status (Client mode only) (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:nzwidth="0x1" edc:desc="Comparison Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="SFERR" edc:nzwidth="0x1" edc:desc="Client Mode Frame Error (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SPIENS" edc:nzwidth="0x1" edc:desc="SPI Enable Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TXFEF" edc:nzwidth="0x1" edc:desc="Transmit FIFO Empty Flag (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="TXFFF" edc:nzwidth="0x1" edc:desc="Transmit FIFO Full Flag (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="TXFTHF" edc:nzwidth="0x1" edc:desc="Transmit FIFO Threshold Flag (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="RXFEF" edc:nzwidth="0x1" edc:desc="Receive FIFO Empty Flag"/>
            <edc:SFRFieldDef edc:cname="RXFFF" edc:nzwidth="0x1" edc:desc="Receive FIFO Full Flag"/>
            <edc:SFRFieldDef edc:cname="RXFTHF" edc:nzwidth="0x1" edc:desc="Receive FIFO Threshold Flag"/>
            <edc:SFRFieldDef edc:cname="TXFPTEF" edc:nzwidth="0x1" edc:desc="Transmit FIFO Pointer Error Flag"/>
            <edc:SFRFieldDef edc:cname="RXFPTEF" edc:nzwidth="0x1" edc:desc="Receive FIFO Pointer Error Flag"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM7" edc:cname="FLEX_SPI_IER" edc:nzwidth="0x20" edc:access="wwwwwwww-----------wwwwwwwwwwwww" edc:impl="0xFF001FFF" edc:_addr="0x4001C414">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM7">
            <edc:SFRFieldDef edc:cname="RDRF" edc:nzwidth="0x1" edc:desc="Receive Data Register Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TDRE" edc:nzwidth="0x1" edc:desc="SPI Transmit Data Register Empty Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MODF" edc:nzwidth="0x1" edc:desc="Mode Fault Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVRES" edc:nzwidth="0x1" edc:desc="Overrun Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Buffer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of Transmit Buffer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Receive Buffer Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Transmit Buffer Empty Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NSSR" edc:nzwidth="0x1" edc:desc="NSS Rising Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Transmission Registers Empty Enable"/>
            <edc:SFRFieldDef edc:cname="UNDES" edc:nzwidth="0x1" edc:desc="Underrun Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:nzwidth="0x1" edc:desc="Comparison Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SFERR" edc:nzwidth="0x1" edc:desc="Client Mode Frame Error Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="TXFEF" edc:nzwidth="0x1" edc:desc="TXFEF Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXFFF" edc:nzwidth="0x1" edc:desc="TXFFF Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXFTHF" edc:nzwidth="0x1" edc:desc="TXFTHF Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXFEF" edc:nzwidth="0x1" edc:desc="RXFEF Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXFFF" edc:nzwidth="0x1" edc:desc="RXFFF Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXFTHF" edc:nzwidth="0x1" edc:desc="RXFTHF Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXFPTEF" edc:nzwidth="0x1" edc:desc="TXFPTEF Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXFPTEF" edc:nzwidth="0x1" edc:desc="RXFPTEF Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM7" edc:cname="FLEX_SPI_IDR" edc:nzwidth="0x20" edc:access="wwwwwwww-----------wwwwwwwwwwwww" edc:impl="0xFF001FFF" edc:_addr="0x4001C418">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM7">
            <edc:SFRFieldDef edc:cname="RDRF" edc:nzwidth="0x1" edc:desc="Receive Data Register Full Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TDRE" edc:nzwidth="0x1" edc:desc="SPI Transmit Data Register Empty Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="MODF" edc:nzwidth="0x1" edc:desc="Mode Fault Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="OVRES" edc:nzwidth="0x1" edc:desc="Overrun Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Buffer Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of Transmit Buffer Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Receive Buffer Full Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Transmit Buffer Empty Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="NSSR" edc:nzwidth="0x1" edc:desc="NSS Rising Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Transmission Registers Empty Disable"/>
            <edc:SFRFieldDef edc:cname="UNDES" edc:nzwidth="0x1" edc:desc="Underrun Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:nzwidth="0x1" edc:desc="Comparison Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="SFERR" edc:nzwidth="0x1" edc:desc="Client Mode Frame Error Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="TXFEF" edc:nzwidth="0x1" edc:desc="TXFEF Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXFFF" edc:nzwidth="0x1" edc:desc="TXFFF Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXFTHF" edc:nzwidth="0x1" edc:desc="TXFTHF Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXFEF" edc:nzwidth="0x1" edc:desc="RXFEF Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXFFF" edc:nzwidth="0x1" edc:desc="RXFFF Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXFTHF" edc:nzwidth="0x1" edc:desc="RXFTHF Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXFPTEF" edc:nzwidth="0x1" edc:desc="TXFPTEF Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXFPTEF" edc:nzwidth="0x1" edc:desc="RXFPTEF Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM7" edc:cname="FLEX_SPI_IMR" edc:nzwidth="0x20" edc:access="rrrrrrrr-----------rrrrrrrrrrrrr" edc:impl="0xFF001FFF" edc:_addr="0x4001C41C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM7">
            <edc:SFRFieldDef edc:cname="RDRF" edc:nzwidth="0x1" edc:desc="Receive Data Register Full Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TDRE" edc:nzwidth="0x1" edc:desc="SPI Transmit Data Register Empty Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="MODF" edc:nzwidth="0x1" edc:desc="Mode Fault Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="OVRES" edc:nzwidth="0x1" edc:desc="Overrun Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Buffer Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of Transmit Buffer Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Receive Buffer Full Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Transmit Buffer Empty Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="NSSR" edc:nzwidth="0x1" edc:desc="NSS Rising Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Transmission Registers Empty Mask"/>
            <edc:SFRFieldDef edc:cname="UNDES" edc:nzwidth="0x1" edc:desc="Underrun Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:nzwidth="0x1" edc:desc="Comparison Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="SFERR" edc:nzwidth="0x1" edc:desc="Client Mode Frame Error Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="TXFEF" edc:nzwidth="0x1" edc:desc="TXFEF Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXFFF" edc:nzwidth="0x1" edc:desc="TXFFF Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXFTHF" edc:nzwidth="0x1" edc:desc="TXFTHF Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXFEF" edc:nzwidth="0x1" edc:desc="RXFEF Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXFFF" edc:nzwidth="0x1" edc:desc="RXFFF Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXFTHF" edc:nzwidth="0x1" edc:desc="RXFTHF Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXFPTEF" edc:nzwidth="0x1" edc:desc="TXFPTEF Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXFPTEF" edc:nzwidth="0x1" edc:desc="RXFPTEF Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
