Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/edc/PIC32CX2051MTC128S1.PIC
      <edc:AdjustPoint edc:offset="0x74" edc:_addr="0x4001C670"/>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM7" edc:cname="FLEX_TWI_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-----nnn" edc:impl="0xFFFFFF07" edc:_addr="0x4001C6E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM7">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:SFRFieldDef edc:cname="WPITEN" edc:nzwidth="0x1" edc:desc="Write Protection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="WPCREN" edc:nzwidth="0x1" edc:desc="Write Protection Control Enable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of bits WPEN, WPITEN and WPCREN. Always reads as 0" edc:when="(field &amp; 0xFFFFFF) == 0x545749"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM7" edc:cname="FLEX_TWI_WPSR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrr-------r" edc:impl="0xFFFFFF01" edc:_addr="0x4001C6E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM7">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protect Violation Status (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x18" edc:desc="Write Protection Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3914" edc:_addr="0x4001C6EC"/>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_CR" edc:nzwidth="0x20" edc:access="-------w-------------wwww-----ww" edc:impl="0x1000783" edc:_addr="0x40020000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="QSPIEN" edc:nzwidth="0x1" edc:desc="QSPI Enable"/>
            <edc:SFRFieldDef edc:cname="QSPIDIS" edc:nzwidth="0x1" edc:desc="QSPI Disable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="QSPI Software Reset"/>
            <edc:SFRFieldDef edc:cname="UPDCFG" edc:nzwidth="0x1" edc:desc="Update Configuration"/>
            <edc:SFRFieldDef edc:cname="STTFR" edc:nzwidth="0x1" edc:desc="Start Transfer"/>
            <edc:SFRFieldDef edc:cname="RTOUT" edc:nzwidth="0x1" edc:desc="Reset Time-out"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="LASTXFER" edc:nzwidth="0x1" edc:desc="Last Transfer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_MR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn----nnnnn-nn-n-n" edc:impl="0xFFFF0FB5" edc:_addr="0x40020004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="SMM" edc:nzwidth="0x1" edc:desc="Serial Memory Mode">
              <edc:SFRFieldSemantic edc:cname="SPI" edc:desc="The QSPI is in SPI mode." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="MEMORY" edc:desc="The QSPI is in Serial Memory mode." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WDRBT" edc:nzwidth="0x1" edc:desc="Wait Data Read Before Transfer">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="No effect. In SPI mode, a transfer can be initiated whatever the state of QSPI_RDR is." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="In SPI mode, a transfer can start only if QSPI_RDR is empty, i.e., does not contain any unread data. This mode prevents overrun error in reception." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CSMODE" edc:nzwidth="0x2" edc:desc="Chip Select Mode">
              <edc:SFRFieldSemantic edc:cname="NOT_RELOADED" edc:desc="The chip select is deasserted if QSPI_TDR.TD has not been reloaded before the end of the current transfer." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LASTXFER" edc:desc="The chip select is deasserted when the bit LASTXFER is written to '1' and the character written in QSPI_TDR.TD has been transferred." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SYSTEMATICALLY" edc:desc="The chip select is deasserted systematically after each transfer." edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TAMPCLR" edc:nzwidth="0x1" edc:desc="Tamper Clear Enable"/>
            <edc:SFRFieldDef edc:cname="NBBITS" edc:nzwidth="0x4" edc:desc="Number Of Bits Per Transfer">
              <edc:SFRFieldSemantic edc:cname="8_BIT" edc:desc="8 bits for transfer" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="16_BIT" edc:desc="16 bits for transfer" edc:when="(field &amp; 0xF) == 0x08"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DLYBCT" edc:nzwidth="0x8" edc:desc="Delay Between Consecutive Transfers"/>
            <edc:SFRFieldDef edc:cname="DLYCS" edc:nzwidth="0x8" edc:desc="Minimum Inactive QCS Delay"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_RDR" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x40020008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="RD" edc:nzwidth="0x10" edc:desc="Receive Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
