Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/edc/PIC32CX2051MTC128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_IMR" edc:nzwidth="0x20" edc:access="--------------r-rrrrrr-rrrrrrrrr" edc:impl="0x2FDFF" edc:_addr="0x4002001C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="RDRF" edc:nzwidth="0x1" edc:desc="Receive Data Register Full Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TDRE" edc:nzwidth="0x1" edc:desc="Transmit Data Register Empty Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Transmission Registers Empty Mask"/>
            <edc:SFRFieldDef edc:cname="OVRES" edc:nzwidth="0x1" edc:desc="Overrun Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Buffer Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of Transmit Buffer Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Receive Buffer Full Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Transmit Buffer Empty Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CSR" edc:nzwidth="0x1" edc:desc="Chip Select Rise Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="INSTRE" edc:nzwidth="0x1" edc:desc="Instruction End Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LWRA" edc:nzwidth="0x1" edc:desc="Last Write Access Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="QITF" edc:nzwidth="0x1" edc:desc="QSPI Interrupt Fall Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="QITR" edc:nzwidth="0x1" edc:desc="QSPI Interrupt Rise Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CSFA" edc:nzwidth="0x1" edc:desc="Chip Select Fall Autoclear Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CSRA" edc:nzwidth="0x1" edc:desc="Chip Select Rise Autoclear Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TOUT" edc:nzwidth="0x1" edc:desc="QSPI Time-out Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_SCR" edc:nzwidth="0x20" edc:access="--------nnnnnnnn--------------nn" edc:impl="0xFF0003" edc:_addr="0x40020020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="CPOL" edc:nzwidth="0x1" edc:desc="Clock Polarity"/>
            <edc:SFRFieldDef edc:cname="CPHA" edc:nzwidth="0x1" edc:desc="Clock Phase"/>
            <edc:AdjustPoint edc:offset="0xE"/>
            <edc:SFRFieldDef edc:cname="DLYBS" edc:nzwidth="0x8" edc:desc="Delay Before QSCK"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_SR" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:impl="0x1F" edc:_addr="0x40020024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="SYNCBSY" edc:nzwidth="0x1" edc:desc="Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="QSPIENS" edc:nzwidth="0x1" edc:desc="QSPI Enable Status"/>
            <edc:SFRFieldDef edc:cname="CSS" edc:nzwidth="0x1" edc:desc="Chip Select Status"/>
            <edc:SFRFieldDef edc:cname="RBUSY" edc:nzwidth="0x1" edc:desc="Read Busy"/>
            <edc:SFRFieldDef edc:cname="HIDLE" edc:nzwidth="0x1" edc:desc="QSPI Idle"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40020028"/>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_IAR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40020030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x20" edc:desc="Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_WICR" edc:nzwidth="0x20" edc:access="--------nnnnnnnn--------nnnnnnnn" edc:impl="0xFF00FF" edc:_addr="0x40020034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="WRINST" edc:nzwidth="0x8" edc:desc="Write Instruction Code"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="WROPT" edc:nzwidth="0x8" edc:desc="Write Option Code"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_IFR" edc:nzwidth="0x20" edc:access="--nn-nnnn--nnnnnnn-nnnnnnnnnnnnn" edc:impl="0x379FDFFF" edc:_addr="0x40020038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="WIDTH" edc:nzwidth="0x4" edc:desc="Width of Instruction Code, Address, Option Code and Data">
              <edc:SFRFieldSemantic edc:cname="SINGLE_BIT_SPI" edc:desc="Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Single-bit SPI" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DUAL_OUTPUT" edc:desc="Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Dual SPI" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="QUAD_OUTPUT" edc:desc="Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Quad SPI" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DUAL_IO" edc:desc="Instruction: Single-bit SPI / Address-Option: Dual SPI / Data: Dual SPI" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="QUAD_IO" edc:desc="Instruction: Single-bit SPI / Address-Option: Quad SPI / Data: Quad SPI" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DUAL_CMD" edc:desc="Instruction: Dual SPI / Address-Option: Dual SPI / Data: Dual SPI" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="QUAD_CMD" edc:desc="Instruction: Quad SPI / Address-Option: Quad SPI / Data: Quad SPI" edc:when="(field &amp; 0xF) == 0x06"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="INSTEN" edc:nzwidth="0x1" edc:desc="Instruction Enable"/>
            <edc:SFRFieldDef edc:cname="ADDREN" edc:nzwidth="0x1" edc:desc="Address Enable"/>
            <edc:SFRFieldDef edc:cname="OPTEN" edc:nzwidth="0x1" edc:desc="Option Enable"/>
            <edc:SFRFieldDef edc:cname="DATAEN" edc:nzwidth="0x1" edc:desc="Data Enable"/>
            <edc:SFRFieldDef edc:cname="OPTL" edc:nzwidth="0x2" edc:desc="Option Code Length">
              <edc:SFRFieldSemantic edc:cname="OPTION_1BIT" edc:desc="The option code is 1 bit long." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="OPTION_2BIT" edc:desc="The option code is 2 bits long." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="OPTION_4BIT" edc:desc="The option code is 4 bits long." edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="OPTION_8BIT" edc:desc="The option code is 8 bits long." edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ADDRL" edc:nzwidth="0x2" edc:desc="Address Length">
              <edc:SFRFieldSemantic edc:cname="_8_BIT" edc:desc="8-bit address size" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="_16_BIT" edc:desc="16-bit address size" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="_24_BIT" edc:desc="24-bit address size" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="_32_BIT" edc:desc="32-bit address size" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TFRTYP" edc:nzwidth="0x1" edc:desc="Data Transfer Type">
              <edc:SFRFieldSemantic edc:cname="TRSFR_REGISTER" edc:desc="Read/Write of memory register, write of memory page buffer. This configuration implies the following: Either the AHB or the APB interface can be used to initiate the transfer (SMRM bit). Returned data represents the memory register value. If the APB interface is used, the RDRF and TDRE flags help to control the frame. Scrambling is possible only if the APB interface is used. For HyperFlash memories the &quot;target&quot; bit is set to register space in the HyperFlash header." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TRSFR_MEMORY" edc:desc="Read/Write accesses to the memory space. This configuration implies the following: Only the System Bus interface can be used to trigger accesses. Access to random location is possible. Address mask is applied and full size accesses only are performed. Internal optimization algorithm is enabled to minimize latency. Data are returned in a system bus protocol compliant way. Seamless scrambling is enabled. Seamless handling of HyperFlash Write Buffer programming command (one command for each data) Seamless protocol-specific page boundary handling Address shift is handled seamlessly (e.g. halfword memories)." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CRM" edc:nzwidth="0x1" edc:desc="Continuous Read Mode">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Continuous Read mode is disabled." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Continuous Read mode is enabled." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DDREN" edc:nzwidth="0x1" edc:desc="DDR Mode Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Transfers are performed in Single Data Rate mode." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Transfers are performed in Double Data Rate mode, whereas the instruction field is still transferred in Single Data Rate mode." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NBDUM" edc:nzwidth="0x5" edc:desc="Number Of Dummy Cycles"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SMRM" edc:nzwidth="0x1" edc:desc="Serial Memory Register Mode"/>
            <edc:SFRFieldDef edc:cname="APBTFRTYP" edc:nzwidth="0x1" edc:desc="Peripheral BusTransfer Type"/>
            <edc:SFRFieldDef edc:cname="DQSEN" edc:nzwidth="0x1" edc:desc="DQS Sampling Enable"/>
            <edc:SFRFieldDef edc:cname="DDRCMDEN" edc:nzwidth="0x1" edc:desc="DDR Mode Command Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Transfer of instruction field is performed in Single Data Rate mode even if DDREN is written to '1'." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Transfer of instruction field is performed in Double Data Rate mode if DDREN bit is written to '1'. If DDREN is written to '0', the instruction field is sent in Single Data Rate mode." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PROTTYP" edc:nzwidth="0x2" edc:desc="Protocol Type">
              <edc:SFRFieldSemantic edc:cname="STD_SPI" edc:desc="Standard (Q)SPI Protocol" edc:when="(field &amp; 0x3) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_RICR" edc:nzwidth="0x20" edc:access="--------nnnnnnnn--------nnnnnnnn" edc:impl="0xFF00FF" edc:_addr="0x4002003C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="RDINST" edc:nzwidth="0x8" edc:desc="Read Instruction Code"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="RDOPT" edc:nzwidth="0x8" edc:desc="Read Option Code"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_SMR" edc:nzwidth="0x20" edc:access="-----------------------------nnn" edc:impl="0x7" edc:_addr="0x40020040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="SCREN" edc:nzwidth="0x1" edc:desc="Scrambling/Unscrambling Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The scrambling/unscrambling is disabled." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The scrambling/unscrambling is enabled." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RVDIS" edc:nzwidth="0x1" edc:desc="Scrambling/Unscrambling Random Value Disable"/>
            <edc:SFRFieldDef edc:cname="SCRKL" edc:nzwidth="0x1" edc:desc="Scrambling Key Lock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
