Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/edc/PIC32CX2051MTC128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_SFR6" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40044128">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register Fields"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_SFR7" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4004412C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register Fields"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_SFR8" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40044130">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register Fields"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_SFR9" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40044134">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register Fields"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_SFR10" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40044138">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register Fields"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_SFR11" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4004413C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register Fields"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_SFR12" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40044140">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register Fields"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_SFR13" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40044144">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register Fields"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_SFR14" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40044148">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register Fields"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_SFR15" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4004414C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register Fields"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_MEIER" edc:nzwidth="0x20" edc:access="----------------wwwwwwwwwwwwwwww" edc:impl="0xFFFF" edc:_addr="0x40044150">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="MERR0" edc:nzwidth="0x1" edc:desc="Master 0 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR1" edc:nzwidth="0x1" edc:desc="Master 1 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR2" edc:nzwidth="0x1" edc:desc="Master 2 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR3" edc:nzwidth="0x1" edc:desc="Master 3 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR4" edc:nzwidth="0x1" edc:desc="Master 4 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR5" edc:nzwidth="0x1" edc:desc="Master 5 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR6" edc:nzwidth="0x1" edc:desc="Master 6 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR7" edc:nzwidth="0x1" edc:desc="Master 7 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR8" edc:nzwidth="0x1" edc:desc="Master 8 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR9" edc:nzwidth="0x1" edc:desc="Master 9 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR10" edc:nzwidth="0x1" edc:desc="Master 10 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR11" edc:nzwidth="0x1" edc:desc="Master 11 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR12" edc:nzwidth="0x1" edc:desc="Master 12 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR13" edc:nzwidth="0x1" edc:desc="Master 13 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR14" edc:nzwidth="0x1" edc:desc="Master 14 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR15" edc:nzwidth="0x1" edc:desc="Master 15 Access Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_MEIDR" edc:nzwidth="0x20" edc:access="----------------wwwwwwwwwwwwwwww" edc:impl="0xFFFF" edc:_addr="0x40044154">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="MERR0" edc:nzwidth="0x1" edc:desc="Master 0 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR1" edc:nzwidth="0x1" edc:desc="Master 1 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR2" edc:nzwidth="0x1" edc:desc="Master 2 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR3" edc:nzwidth="0x1" edc:desc="Master 3 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR4" edc:nzwidth="0x1" edc:desc="Master 4 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR5" edc:nzwidth="0x1" edc:desc="Master 5 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR6" edc:nzwidth="0x1" edc:desc="Master 6 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR7" edc:nzwidth="0x1" edc:desc="Master 7 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR8" edc:nzwidth="0x1" edc:desc="Master 8 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR9" edc:nzwidth="0x1" edc:desc="Master 9 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR10" edc:nzwidth="0x1" edc:desc="Master 10 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR11" edc:nzwidth="0x1" edc:desc="Master 11 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR12" edc:nzwidth="0x1" edc:desc="Master 12 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR13" edc:nzwidth="0x1" edc:desc="Master 13 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR14" edc:nzwidth="0x1" edc:desc="Master 14 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR15" edc:nzwidth="0x1" edc:desc="Master 15 Access Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_MEIMR" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x40044158">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="MERR0" edc:nzwidth="0x1" edc:desc="Master 0 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR1" edc:nzwidth="0x1" edc:desc="Master 1 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR2" edc:nzwidth="0x1" edc:desc="Master 2 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR3" edc:nzwidth="0x1" edc:desc="Master 3 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR4" edc:nzwidth="0x1" edc:desc="Master 4 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR5" edc:nzwidth="0x1" edc:desc="Master 5 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR6" edc:nzwidth="0x1" edc:desc="Master 6 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR7" edc:nzwidth="0x1" edc:desc="Master 7 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR8" edc:nzwidth="0x1" edc:desc="Master 8 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR9" edc:nzwidth="0x1" edc:desc="Master 9 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR10" edc:nzwidth="0x1" edc:desc="Master 10 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR11" edc:nzwidth="0x1" edc:desc="Master 11 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR12" edc:nzwidth="0x1" edc:desc="Master 12 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR13" edc:nzwidth="0x1" edc:desc="Master 13 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR14" edc:nzwidth="0x1" edc:desc="Master 14 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR15" edc:nzwidth="0x1" edc:desc="Master 15 Access Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_MESR" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x4004415C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="MERR0" edc:nzwidth="0x1" edc:desc="Master 0 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR1" edc:nzwidth="0x1" edc:desc="Master 1 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR2" edc:nzwidth="0x1" edc:desc="Master 2 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR3" edc:nzwidth="0x1" edc:desc="Master 3 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR4" edc:nzwidth="0x1" edc:desc="Master 4 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR5" edc:nzwidth="0x1" edc:desc="Master 5 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR6" edc:nzwidth="0x1" edc:desc="Master 6 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR7" edc:nzwidth="0x1" edc:desc="Master 7 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR8" edc:nzwidth="0x1" edc:desc="Master 8 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR9" edc:nzwidth="0x1" edc:desc="Master 9 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR10" edc:nzwidth="0x1" edc:desc="Master 10 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR11" edc:nzwidth="0x1" edc:desc="Master 11 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR12" edc:nzwidth="0x1" edc:desc="Master 12 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR13" edc:nzwidth="0x1" edc:desc="Master 13 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR14" edc:nzwidth="0x1" edc:desc="Master 14 Access Error"/>
            <edc:SFRFieldDef edc:cname="MERR15" edc:nzwidth="0x1" edc:desc="Master 15 Access Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_MEAR0" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40044160">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="ERRADD" edc:nzwidth="0x20" edc:desc="Master Error Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
