Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/edc/PIC32CX2051MTC128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_IMR" edc:nzwidth="0x20" edc:access="--------------------------rrrrrr" edc:impl="0x3F" edc:_addr="0x40053128">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="ACK" edc:nzwidth="0x1" edc:desc="Acknowledge Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="ALR" edc:nzwidth="0x1" edc:desc="Alarm Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="SEC" edc:nzwidth="0x1" edc:desc="Second Event Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TIM" edc:nzwidth="0x1" edc:desc="Time Event Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CAL" edc:nzwidth="0x1" edc:desc="Calendar Event Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TDERR" edc:nzwidth="0x1" edc:desc="Time and/or Date Error Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_VER" edc:nzwidth="0x20" edc:access="----------------------------rrrr" edc:impl="0xF" edc:_addr="0x4005312C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="NVTIM" edc:nzwidth="0x1" edc:desc="Non-valid Time"/>
            <edc:SFRFieldDef edc:cname="NVCAL" edc:nzwidth="0x1" edc:desc="Non-valid Calendar"/>
            <edc:SFRFieldDef edc:cname="NVTIMALR" edc:nzwidth="0x1" edc:desc="Non-valid Time Alarm"/>
            <edc:SFRFieldDef edc:cname="NVCALALR" edc:nzwidth="0x1" edc:desc="Non-valid Calendar Alarm"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40053130"/>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_TCR" edc:nzwidth="0x20" edc:access="--------------nn-----------nnnnn" edc:impl="0x3001F" edc:_addr="0x40053134">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="TAMPEN0" edc:nzwidth="0x1" edc:desc="Timestamping on TMPx input is enabled">
              <edc:SFRFieldSemantic edc:cname="TIMESTAMP_OFF" edc:desc="Tamper event on TMPx input is not timestamped." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TIMESTAMP_ON" edc:desc="Tamper event on TMPx input is timestamped." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TAMPEN1" edc:nzwidth="0x1" edc:desc="Timestamping on TMPx input is enabled">
              <edc:SFRFieldSemantic edc:cname="TIMESTAMP_OFF" edc:desc="Tamper event on TMPx input is not timestamped." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TIMESTAMP_ON" edc:desc="Tamper event on TMPx input is timestamped." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TAMPEN2" edc:nzwidth="0x1" edc:desc="Timestamping on TMPx input is enabled">
              <edc:SFRFieldSemantic edc:cname="TIMESTAMP_OFF" edc:desc="Tamper event on TMPx input is not timestamped." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TIMESTAMP_ON" edc:desc="Tamper event on TMPx input is timestamped." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TAMPEN3" edc:nzwidth="0x1" edc:desc="Timestamping on TMPx input is enabled">
              <edc:SFRFieldSemantic edc:cname="TIMESTAMP_OFF" edc:desc="Tamper event on TMPx input is not timestamped." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TIMESTAMP_ON" edc:desc="Tamper event on TMPx input is timestamped." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TAMPEN4" edc:nzwidth="0x1" edc:desc="Timestamping on TMPx input is enabled">
              <edc:SFRFieldSemantic edc:cname="TIMESTAMP_OFF" edc:desc="Tamper event on TMPx input is not timestamped." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TIMESTAMP_ON" edc:desc="Tamper event on TMPx input is timestamped." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="TAMPCLR" edc:nzwidth="0x1" edc:desc="Tamper Clear">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="A Tamper event does not create an immediate clear on GPBR registers." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="Tamper event on TMP0 or TMP4 generates an immediate clear on GPBR registers. The number of cleared GPBR registers depends on the value of FGPBRCLR." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FGPBRCLR" edc:nzwidth="0x1" edc:desc="Full GPBR Clear">
              <edc:SFRFieldSemantic edc:cname="HALF" edc:desc="If TAMPCLR is set to '1', a tamper event immediately clears GPBR0 to GPBR11." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="FULL" edc:desc="If TAMPCLR is set to '1', a tamper event immediately clears all GPBRs." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_TISR" edc:nzwidth="0x20" edc:access="---------------------------rrrrr" edc:impl="0x1F" edc:_addr="0x40053138">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="TISR0" edc:nzwidth="0x1" edc:desc="TMPx Input Status Register"/>
            <edc:SFRFieldDef edc:cname="TISR1" edc:nzwidth="0x1" edc:desc="TMPx Input Status Register"/>
            <edc:SFRFieldDef edc:cname="TISR2" edc:nzwidth="0x1" edc:desc="TMPx Input Status Register"/>
            <edc:SFRFieldDef edc:cname="TISR3" edc:nzwidth="0x1" edc:desc="TMPx Input Status Register"/>
            <edc:SFRFieldDef edc:cname="TISR4" edc:nzwidth="0x1" edc:desc="TMPx Input Status Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
