Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/edc/PIC32CX2051MTC128S1.PIC
      <edc:AdjustPoint edc:offset="0x14" edc:_addr="0x46800030"/>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PCK0" edc:nzwidth="0x20" edc:access="----------------nnnnnnnn---nnnnn" edc:impl="0xFF1F" edc:_addr="0x46800044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CSS" edc:nzwidth="0x5" edc:desc="Programmable Clock Source Selection">
              <edc:SFRFieldSemantic edc:cname="MD_SLOW_CLK" edc:desc="MD_SLCK is selected" edc:when="(field &amp; 0x1F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TD_SLOW_CLOCK" edc:desc="TD_SLCK is selected" edc:when="(field &amp; 0x1F) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="MAINCK" edc:desc="MAINCK is selected" edc:when="(field &amp; 0x1F) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="MCK0" edc:desc="MCK0 is selected" edc:when="(field &amp; 0x1F) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="PLLACK1" edc:desc="PLLACK1 is selected." edc:when="(field &amp; 0x1F) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="PLLBCK" edc:desc="PLLBCK is selected." edc:when="(field &amp; 0x1F) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="PLLCCK" edc:desc="PLLCCK is selected." edc:when="(field &amp; 0x1F) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="PLLCSRC" edc:desc="PLLCSRC is selected." edc:when="(field &amp; 0x1F) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:nzwidth="0x8" edc:desc="Programmable Clock Prescaler"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PCK1" edc:nzwidth="0x20" edc:access="----------------nnnnnnnn---nnnnn" edc:impl="0xFF1F" edc:_addr="0x46800048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CSS" edc:nzwidth="0x5" edc:desc="Programmable Clock Source Selection">
              <edc:SFRFieldSemantic edc:cname="MD_SLOW_CLK" edc:desc="MD_SLCK is selected" edc:when="(field &amp; 0x1F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TD_SLOW_CLOCK" edc:desc="TD_SLCK is selected" edc:when="(field &amp; 0x1F) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="MAINCK" edc:desc="MAINCK is selected" edc:when="(field &amp; 0x1F) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="MCK0" edc:desc="MCK0 is selected" edc:when="(field &amp; 0x1F) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="PLLACK1" edc:desc="PLLACK1 is selected." edc:when="(field &amp; 0x1F) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="PLLBCK" edc:desc="PLLBCK is selected." edc:when="(field &amp; 0x1F) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="PLLCCK" edc:desc="PLLCCK is selected." edc:when="(field &amp; 0x1F) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="PLLCSRC" edc:desc="PLLCSRC is selected." edc:when="(field &amp; 0x1F) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:nzwidth="0x8" edc:desc="Programmable Clock Prescaler"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PCK2" edc:nzwidth="0x20" edc:access="----------------nnnnnnnn---nnnnn" edc:impl="0xFF1F" edc:_addr="0x4680004C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CSS" edc:nzwidth="0x5" edc:desc="Programmable Clock Source Selection">
              <edc:SFRFieldSemantic edc:cname="MD_SLOW_CLK" edc:desc="MD_SLCK is selected" edc:when="(field &amp; 0x1F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TD_SLOW_CLOCK" edc:desc="TD_SLCK is selected" edc:when="(field &amp; 0x1F) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="MAINCK" edc:desc="MAINCK is selected" edc:when="(field &amp; 0x1F) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="MCK0" edc:desc="MCK0 is selected" edc:when="(field &amp; 0x1F) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="PLLACK1" edc:desc="PLLACK1 is selected." edc:when="(field &amp; 0x1F) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="PLLBCK" edc:desc="PLLBCK is selected." edc:when="(field &amp; 0x1F) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="PLLCCK" edc:desc="PLLCCK is selected." edc:when="(field &amp; 0x1F) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="PLLCSRC" edc:desc="PLLCSRC is selected." edc:when="(field &amp; 0x1F) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:nzwidth="0x8" edc:desc="Programmable Clock Prescaler"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x14" edc:_addr="0x46800050"/>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_IER" edc:nzwidth="0x20" edc:access="--------w-w--www----wwww---ww--w" edc:impl="0xA70F19" edc:_addr="0x46800064">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MOSCXTS" edc:nzwidth="0x1" edc:desc="Main Crystal Oscillator Status Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MCKRDY" edc:nzwidth="0x1" edc:desc="Master Clock 0 Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CPMCKRDY" edc:nzwidth="0x1" edc:desc="Coprocessor Master Clock Ready Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PCKRDY0" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PCKRDY1" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 1 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PCKRDY2" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 2 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PCKRDY3" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 3 Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MOSCSELS" edc:nzwidth="0x1" edc:desc="Main Clock Source Oscillator Selection Status Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MOSCRCS" edc:nzwidth="0x1" edc:desc="Main RC Oscillator Status Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CFDEV" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Event Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="XT32KERR" edc:nzwidth="0x1" edc:desc="32.768 kHz Crystal Oscillator Error Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKMON" edc:nzwidth="0x1" edc:desc="Master Clock 0 Clock Monitor Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_IDR" edc:nzwidth="0x20" edc:access="--------w-w--www----wwww---ww--w" edc:impl="0xA70F19" edc:_addr="0x46800068">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MOSCXTS" edc:nzwidth="0x1" edc:desc="Main Crystal Oscillator Status Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MCKRDY" edc:nzwidth="0x1" edc:desc="Master Clock 0 Ready Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CPMCKRDY" edc:nzwidth="0x1" edc:desc="Coprocessor Master Clock Ready Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PCKRDY0" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 0 Interrupt DIsable"/>
            <edc:SFRFieldDef edc:cname="PCKRDY1" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 1 Interrupt DIsable"/>
            <edc:SFRFieldDef edc:cname="PCKRDY2" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 2 Interrupt DIsable"/>
            <edc:SFRFieldDef edc:cname="PCKRDY3" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 3 Interrupt DIsable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MOSCSELS" edc:nzwidth="0x1" edc:desc="Main Clock Source Oscillator Selection Status Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="MOSCRCS" edc:nzwidth="0x1" edc:desc="Main RC Status Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CFDEV" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Event Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="XT32KERR" edc:nzwidth="0x1" edc:desc="32.768 kHz Crystal Oscillator Error Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKMON" edc:nzwidth="0x1" edc:desc="Master Clock 0 Clock Monitor Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_SR" edc:nzwidth="0x20" edc:access="------rrr-rrrrrr----rrrrr--rr--r" edc:impl="0x3BF0F99" edc:_addr="0x4680006C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MOSCXTS" edc:nzwidth="0x1" edc:desc="Main Crystal Oscillator Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MCKRDY" edc:nzwidth="0x1" edc:desc="Master Clock 0 Status"/>
            <edc:SFRFieldDef edc:cname="CPMCKRDY" edc:nzwidth="0x1" edc:desc="Coprocessor Master Clock Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OSCSELS" edc:nzwidth="0x1" edc:desc="Monitoring Domain Slow Clock Source Oscillator Selection"/>
            <edc:SFRFieldDef edc:cname="PCKRDY0" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready Status"/>
            <edc:SFRFieldDef edc:cname="PCKRDY1" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready Status"/>
            <edc:SFRFieldDef edc:cname="PCKRDY2" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready Status"/>
            <edc:SFRFieldDef edc:cname="PCKRDY3" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready Status"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MOSCSELS" edc:nzwidth="0x1" edc:desc="Main Clock Source Oscillator Selection Status"/>
            <edc:SFRFieldDef edc:cname="MOSCRCS" edc:nzwidth="0x1" edc:desc="Main RC Oscillator Status"/>
            <edc:SFRFieldDef edc:cname="CFDEV" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Event"/>
            <edc:SFRFieldDef edc:cname="CFDS" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Status"/>
            <edc:SFRFieldDef edc:cname="FOS" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Fault Output Status"/>
            <edc:SFRFieldDef edc:cname="XT32KERR" edc:nzwidth="0x1" edc:desc="Slow Crystal Oscillator Error"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKMON" edc:nzwidth="0x1" edc:desc="Master Clock 0 Clock Monitor Error"/>
            <edc:SFRFieldDef edc:cname="GCLKRDY" edc:nzwidth="0x1" edc:desc="GCLK Ready"/>
            <edc:SFRFieldDef edc:cname="PLL_INT" edc:nzwidth="0x1" edc:desc="PLL Interrupt Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_IMR" edc:nzwidth="0x20" edc:access="--------r-r--rrr----rrrr---rr--r" edc:impl="0xA70F19" edc:_addr="0x46800070">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MOSCXTS" edc:nzwidth="0x1" edc:desc="Main Crystal Oscillator Status Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MCKRDY" edc:nzwidth="0x1" edc:desc="Master Clock 0 Ready Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CPMCKRDY" edc:nzwidth="0x1" edc:desc="Coprocessor Master Clock Ready Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PCKRDY0" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 0 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="PCKRDY1" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 1 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="PCKRDY2" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 2 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="PCKRDY3" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 3 Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MOSCSELS" edc:nzwidth="0x1" edc:desc="Main Clock Source Oscillator Selection Status Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="MOSCRCS" edc:nzwidth="0x1" edc:desc="Main RC Status Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CFDEV" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Event Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="XT32KERR" edc:nzwidth="0x1" edc:desc="32.768 kHz Crystal Oscillator Error Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKMON" edc:nzwidth="0x1" edc:desc="Master Clock 0 Monitor Error Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_FSMR" edc:nzwidth="0x20" edc:access="--------nnnnnnnn----------------" edc:impl="0xFF0000" edc:_addr="0x46800074">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="RTTAL" edc:nzwidth="0x1" edc:desc="RTT Alarm Enable"/>
            <edc:SFRFieldDef edc:cname="RTCAL" edc:nzwidth="0x1" edc:desc="RTC Alarm Enable"/>
            <edc:SFRFieldDef edc:cname="XTFA" edc:nzwidth="0x1" edc:desc="32KHz Crystal Failure Alarm Enable"/>
            <edc:SFRFieldDef edc:cname="SMAL" edc:nzwidth="0x1" edc:desc="Supply Monitor Alarm Enable"/>
            <edc:SFRFieldDef edc:cname="LPM" edc:nzwidth="0x1" edc:desc="Low Power Mode"/>
            <edc:SFRFieldDef edc:cname="FLPM" edc:nzwidth="0x2" edc:desc="Flash Low-power Mode">
              <edc:SFRFieldSemantic edc:cname="FLASH_STANDBY" edc:desc="Flash is in Standby Mode when system enters Wait Mode" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="FLASH_DEEP_POWERDOWN" edc:desc="Flash is in Deep-powerdown mode when system enters Wait Mode" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FLASH_IDLE" edc:desc="Idle mode" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FFLPM" edc:nzwidth="0x1" edc:desc="Force Flash Low-power Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
