Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/edc/PIC32CX2051MTC128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_CSR2" edc:nzwidth="0x20" edc:access="----rrrrr-r---rrrr--r-----------" edc:impl="0xFA3C800" edc:_addr="0x468000AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="PID75" edc:nzwidth="0x1" edc:desc="Peripheral Clock 75 Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID78" edc:nzwidth="0x1" edc:desc="Peripheral Clock 78 Status"/>
            <edc:SFRFieldDef edc:cname="PID79" edc:nzwidth="0x1" edc:desc="Peripheral Clock 79 Status"/>
            <edc:SFRFieldDef edc:cname="PID80" edc:nzwidth="0x1" edc:desc="Peripheral Clock 80 Status"/>
            <edc:SFRFieldDef edc:cname="PID81" edc:nzwidth="0x1" edc:desc="Peripheral Clock 81 Status"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PID85" edc:nzwidth="0x1" edc:desc="Peripheral Clock 85 Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID87" edc:nzwidth="0x1" edc:desc="Peripheral Clock 87 Status"/>
            <edc:SFRFieldDef edc:cname="PID88" edc:nzwidth="0x1" edc:desc="Peripheral Clock 88 Status"/>
            <edc:SFRFieldDef edc:cname="PID89" edc:nzwidth="0x1" edc:desc="Peripheral Clock 89 Status"/>
            <edc:SFRFieldDef edc:cname="PID90" edc:nzwidth="0x1" edc:desc="Peripheral Clock 90 Status"/>
            <edc:SFRFieldDef edc:cname="PID91" edc:nzwidth="0x1" edc:desc="Peripheral Clock 91 Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_CSR3" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0x468000B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PID96" edc:nzwidth="0x1" edc:desc="Peripheral Clock 96 Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x468000B4"/>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_GCSR0" edc:nzwidth="0x20" edc:access="r------rr------rrrrrrrr---------" edc:impl="0x8181FE00" edc:_addr="0x468000C4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="GPID9" edc:nzwidth="0x1" edc:desc="Generic Clock 9 Status"/>
            <edc:SFRFieldDef edc:cname="GPID10" edc:nzwidth="0x1" edc:desc="Generic Clock 10 Status"/>
            <edc:SFRFieldDef edc:cname="GPID11" edc:nzwidth="0x1" edc:desc="Generic Clock 11 Status"/>
            <edc:SFRFieldDef edc:cname="GPID12" edc:nzwidth="0x1" edc:desc="Generic Clock 12 Status"/>
            <edc:SFRFieldDef edc:cname="GPID13" edc:nzwidth="0x1" edc:desc="Generic Clock 13 Status"/>
            <edc:SFRFieldDef edc:cname="GPID14" edc:nzwidth="0x1" edc:desc="Generic Clock 14 Status"/>
            <edc:SFRFieldDef edc:cname="GPID15" edc:nzwidth="0x1" edc:desc="Generic Clock 15 Status"/>
            <edc:SFRFieldDef edc:cname="GPID16" edc:nzwidth="0x1" edc:desc="Generic Clock 16 Status"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="GPID23" edc:nzwidth="0x1" edc:desc="Generic Clock 23 Status"/>
            <edc:SFRFieldDef edc:cname="GPID24" edc:nzwidth="0x1" edc:desc="Generic Clock 24 Status"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="GPID31" edc:nzwidth="0x1" edc:desc="Generic Clock 31 Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_GCSR1" edc:nzwidth="0x20" edc:access="--------------------------r--r--" edc:impl="0x24" edc:_addr="0x468000C8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="GPID34" edc:nzwidth="0x1" edc:desc="Generic Clock 34 Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="GPID37" edc:nzwidth="0x1" edc:desc="Generic Clock 37 Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_GCSR2" edc:nzwidth="0x20" edc:access="-----rr-r-------r---r-----------" edc:impl="0x6808800" edc:_addr="0x468000CC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="GPID75" edc:nzwidth="0x1" edc:desc="Generic Clock 75 Status"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="GPID79" edc:nzwidth="0x1" edc:desc="Generic Clock 79 Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="GPID87" edc:nzwidth="0x1" edc:desc="Generic Clock 87 Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="GPID89" edc:nzwidth="0x1" edc:desc="Generic Clock 89 Status"/>
            <edc:SFRFieldDef edc:cname="GPID90" edc:nzwidth="0x1" edc:desc="Generic Clock 90 Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_GCSR3" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0x468000D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="GPID96" edc:nzwidth="0x1" edc:desc="Generic Clock 96 Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x468000D4"/>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PLL_IER" edc:nzwidth="0x20" edc:access="-------------www-------------www" edc:impl="0x70007" edc:_addr="0x468000E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="LOCK0" edc:nzwidth="0x1" edc:desc="PLL of Index 0 Lock Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LOCK1" edc:nzwidth="0x1" edc:desc="PLL of Index 1 Lock Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LOCK2" edc:nzwidth="0x1" edc:desc="PLL of Index 2 Lock Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="UNLOCK0" edc:nzwidth="0x1" edc:desc="PLL of Index 0 Unlock Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNLOCK1" edc:nzwidth="0x1" edc:desc="PLL of Index 1 Unlock Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNLOCK2" edc:nzwidth="0x1" edc:desc="PLL of Index 2 Unlock Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PLL_IDR" edc:nzwidth="0x20" edc:access="-------------www-------------www" edc:impl="0x70007" edc:_addr="0x468000E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="LOCK0" edc:nzwidth="0x1" edc:desc="PLL of Index 0 Lock Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LOCK1" edc:nzwidth="0x1" edc:desc="PLL of Index 1 Lock Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LOCK2" edc:nzwidth="0x1" edc:desc="PLL of Index 2 Lock Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="UNLOCK0" edc:nzwidth="0x1" edc:desc="PLL of Index 0 Unlock Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="UNLOCK1" edc:nzwidth="0x1" edc:desc="PLL of Index 1 Unlock Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="UNLOCK2" edc:nzwidth="0x1" edc:desc="PLL of Index 2 Unlock Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PLL_IMR" edc:nzwidth="0x20" edc:access="-------------rrr-------------rrr" edc:impl="0x70007" edc:_addr="0x468000EC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="LOCK0" edc:nzwidth="0x1" edc:desc="PLL of Index 0 Lock Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LOCK1" edc:nzwidth="0x1" edc:desc="PLL of Index 1 Lock Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LOCK2" edc:nzwidth="0x1" edc:desc="PLL of Index 2 Lock Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="UNLOCK0" edc:nzwidth="0x1" edc:desc="PLL of Index 0 Unlock Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="UNLOCK1" edc:nzwidth="0x1" edc:desc="PLL of Index 1 Unlock Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="UNLOCK2" edc:nzwidth="0x1" edc:desc="PLL of Index 2 Unlock Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PLL_ISR0" edc:nzwidth="0x20" edc:access="-------------rrr-------------rrr" edc:impl="0x70007" edc:_addr="0x468000F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="LOCK0" edc:nzwidth="0x1" edc:desc="PLL of Index 0 Lock Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="LOCK1" edc:nzwidth="0x1" edc:desc="PLL of Index 1 Lock Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="LOCK2" edc:nzwidth="0x1" edc:desc="PLL of Index 2 Lock Interrupt Status"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="UNLOCK0" edc:nzwidth="0x1" edc:desc="PLL of Index 0 Unlock Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="UNLOCK1" edc:nzwidth="0x1" edc:desc="PLL of Index 1 Unlock Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="UNLOCK2" edc:nzwidth="0x1" edc:desc="PLL of Index 2 Unlock Interrupt Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
