Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/edc/PIC32CX2051MTC128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="UART" edc:cname="UART_TPR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x48010108">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART">
            <edc:SFRFieldDef edc:cname="TXPTR" edc:nzwidth="0x20" edc:desc="Transmit Counter Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART" edc:cname="UART_TCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x4801010C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART">
            <edc:SFRFieldDef edc:cname="TXCTR" edc:nzwidth="0x10" edc:desc="Transmit Counter Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART" edc:cname="UART_RNPR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x48010110">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART">
            <edc:SFRFieldDef edc:cname="RXNPTR" edc:nzwidth="0x20" edc:desc="Receive Next Pointer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART" edc:cname="UART_RNCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x48010114">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART">
            <edc:SFRFieldDef edc:cname="RXNCTR" edc:nzwidth="0x10" edc:desc="Receive Next Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART" edc:cname="UART_TNPR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x48010118">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART">
            <edc:SFRFieldDef edc:cname="TXNPTR" edc:nzwidth="0x20" edc:desc="Transmit Next Pointer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART" edc:cname="UART_TNCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x4801011C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART">
            <edc:SFRFieldDef edc:cname="TXNCTR" edc:nzwidth="0x10" edc:desc="Transmit Counter Next"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART" edc:cname="UART_PTCR" edc:nzwidth="0x20" edc:access="-------w----wwww------ww------ww" edc:impl="0x10F0303" edc:_addr="0x48010120">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:nzwidth="0x1" edc:desc="Receiver Transfer Enable"/>
            <edc:SFRFieldDef edc:cname="RXTDIS" edc:nzwidth="0x1" edc:desc="Receiver Transfer Disable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:nzwidth="0x1" edc:desc="Transmitter Transfer Enable"/>
            <edc:SFRFieldDef edc:cname="TXTDIS" edc:nzwidth="0x1" edc:desc="Transmitter Transfer Disable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RXCBEN" edc:nzwidth="0x1" edc:desc="Receiver Circular Buffer Enable"/>
            <edc:SFRFieldDef edc:cname="RXCBDIS" edc:nzwidth="0x1" edc:desc="Receiver Circular Buffer Disable"/>
            <edc:SFRFieldDef edc:cname="TXCBEN" edc:nzwidth="0x1" edc:desc="Transmitter Circular Buffer Enable"/>
            <edc:SFRFieldDef edc:cname="TXCBDIS" edc:nzwidth="0x1" edc:desc="Transmitter Circular Buffer Disable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ERRCLR" edc:nzwidth="0x1" edc:desc="Transfer Bus Error Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART" edc:cname="UART_PTSR" edc:nzwidth="0x20" edc:access="-------r-----r-r-------r-------r" edc:impl="0x1050101" edc:_addr="0x48010124">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:nzwidth="0x1" edc:desc="Receiver Transfer Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:nzwidth="0x1" edc:desc="Transmitter Transfer Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="RXCBEN" edc:nzwidth="0x1" edc:desc="Receiver Circular Buffer Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBEN" edc:nzwidth="0x1" edc:desc="Transmitter Circular Buffer Enable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:nzwidth="0x1" edc:desc="Transfer Bus Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART" edc:cname="UART_PWPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-----nnn" edc:impl="0xFFFFFF07" edc:_addr="0x48010128">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART">
            <edc:SFRFieldDef edc:cname="WPPTREN" edc:nzwidth="0x1" edc:desc="Write Protection Pointer Registers Enable"/>
            <edc:SFRFieldDef edc:cname="WPCTREN" edc:nzwidth="0x1" edc:desc="Write Protection Counter Registers Enable"/>
            <edc:SFRFieldDef edc:cname="WPCREN" edc:nzwidth="0x1" edc:desc="Write Protection Control Register Enable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x504443"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3ED4" edc:_addr="0x4801012C"/>
      <edc:SFRDef ltx:memberofperipheral="IPC1" edc:cname="IPC1_ISCR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x48014000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IPC1">
            <edc:SFRFieldDef edc:cname="IRQ0" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ1" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ2" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ3" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ4" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ5" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ6" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ7" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ8" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ9" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ10" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ11" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ12" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ13" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ14" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ15" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ16" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ17" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ18" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ19" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ20" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ21" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ22" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ23" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ24" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ25" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ26" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ27" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ28" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ29" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ30" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="IRQ31" edc:nzwidth="0x1" edc:desc="Interrupt Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="IPC1" edc:cname="IPC1_ICCR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x48014004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IPC1">
            <edc:SFRFieldDef edc:cname="IRQ0" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ1" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ2" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ3" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ4" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ5" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ6" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ7" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ8" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ9" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ10" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ11" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ12" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ13" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ14" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ15" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ16" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ17" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ18" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ19" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ20" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ21" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ22" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ23" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ24" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ25" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ26" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ27" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ28" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ29" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ30" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="IRQ31" edc:nzwidth="0x1" edc:desc="Interrupt Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="IPC1" edc:cname="IPC1_IPR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x48014008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IPC1">
            <edc:SFRFieldDef edc:cname="IRQ0" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ1" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ2" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ3" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ4" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ5" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ6" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ7" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ8" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ9" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ10" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ11" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ12" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ13" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ14" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ15" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ16" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ17" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ18" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ19" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ20" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ21" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ22" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ23" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ24" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ25" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ26" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ27" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ28" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ29" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ30" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
            <edc:SFRFieldDef edc:cname="IRQ31" edc:nzwidth="0x1" edc:desc="Interrupt Pending"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
