Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/edc/PIC32CX2051MTC128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CMP4PWM_CMPVUPD" edc:nzwidth="0x20" edc:access="-------wwwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0x1FFFFFF" edc:_addr="0x4801C174">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="CVUPD" edc:nzwidth="0x18" edc:desc="Comparison x Value Update"/>
            <edc:SFRFieldDef edc:cname="CVMUPD" edc:nzwidth="0x1" edc:desc="Comparison x Value Mode Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CMP4PWM_CMPM" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnn---n" edc:impl="0xFFFFF1" edc:_addr="0x4801C178">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="CEN" edc:nzwidth="0x1" edc:desc="Comparison x Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTR" edc:nzwidth="0x4" edc:desc="Comparison x Trigger"/>
            <edc:SFRFieldDef edc:cname="CPR" edc:nzwidth="0x4" edc:desc="Comparison x Period"/>
            <edc:SFRFieldDef edc:cname="CPRCNT" edc:nzwidth="0x4" edc:desc="Comparison x Period Counter"/>
            <edc:SFRFieldDef edc:cname="CUPR" edc:nzwidth="0x4" edc:desc="Comparison x Update Period"/>
            <edc:SFRFieldDef edc:cname="CUPRCNT" edc:nzwidth="0x4" edc:desc="Comparison x Update Period Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CMP4PWM_CMPMUPD" edc:nzwidth="0x20" edc:access="------------wwww----wwwwwwww---w" edc:impl="0xF0FF1" edc:_addr="0x4801C17C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="CENUPD" edc:nzwidth="0x1" edc:desc="Comparison x Enable Update"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTRUPD" edc:nzwidth="0x4" edc:desc="Comparison x Trigger Update"/>
            <edc:SFRFieldDef edc:cname="CPRUPD" edc:nzwidth="0x4" edc:desc="Comparison x Period Update"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPRUPD" edc:nzwidth="0x4" edc:desc="Comparison x Update Period Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CMP5PWM_CMPV" edc:nzwidth="0x20" edc:access="-------nnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0x1FFFFFF" edc:_addr="0x4801C180">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="CV" edc:nzwidth="0x18" edc:desc="Comparison x Value"/>
            <edc:SFRFieldDef edc:cname="CVM" edc:nzwidth="0x1" edc:desc="Comparison x Value Mode">
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_INCREMENT" edc:desc="Compare when counter is incrementing" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_DECREMENT" edc:desc="Compare when counter is decrementing" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CMP5PWM_CMPVUPD" edc:nzwidth="0x20" edc:access="-------wwwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0x1FFFFFF" edc:_addr="0x4801C184">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="CVUPD" edc:nzwidth="0x18" edc:desc="Comparison x Value Update"/>
            <edc:SFRFieldDef edc:cname="CVMUPD" edc:nzwidth="0x1" edc:desc="Comparison x Value Mode Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CMP5PWM_CMPM" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnn---n" edc:impl="0xFFFFF1" edc:_addr="0x4801C188">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="CEN" edc:nzwidth="0x1" edc:desc="Comparison x Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTR" edc:nzwidth="0x4" edc:desc="Comparison x Trigger"/>
            <edc:SFRFieldDef edc:cname="CPR" edc:nzwidth="0x4" edc:desc="Comparison x Period"/>
            <edc:SFRFieldDef edc:cname="CPRCNT" edc:nzwidth="0x4" edc:desc="Comparison x Period Counter"/>
            <edc:SFRFieldDef edc:cname="CUPR" edc:nzwidth="0x4" edc:desc="Comparison x Update Period"/>
            <edc:SFRFieldDef edc:cname="CUPRCNT" edc:nzwidth="0x4" edc:desc="Comparison x Update Period Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CMP5PWM_CMPMUPD" edc:nzwidth="0x20" edc:access="------------wwww----wwwwwwww---w" edc:impl="0xF0FF1" edc:_addr="0x4801C18C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="CENUPD" edc:nzwidth="0x1" edc:desc="Comparison x Enable Update"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTRUPD" edc:nzwidth="0x4" edc:desc="Comparison x Trigger Update"/>
            <edc:SFRFieldDef edc:cname="CPRUPD" edc:nzwidth="0x4" edc:desc="Comparison x Period Update"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPRUPD" edc:nzwidth="0x4" edc:desc="Comparison x Update Period Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CMP6PWM_CMPV" edc:nzwidth="0x20" edc:access="-------nnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0x1FFFFFF" edc:_addr="0x4801C190">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="CV" edc:nzwidth="0x18" edc:desc="Comparison x Value"/>
            <edc:SFRFieldDef edc:cname="CVM" edc:nzwidth="0x1" edc:desc="Comparison x Value Mode">
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_INCREMENT" edc:desc="Compare when counter is incrementing" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_DECREMENT" edc:desc="Compare when counter is decrementing" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
