Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/edc/PIC32CX2051MTC128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CMP6PWM_CMPVUPD" edc:nzwidth="0x20" edc:access="-------wwwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0x1FFFFFF" edc:_addr="0x4801C194">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="CVUPD" edc:nzwidth="0x18" edc:desc="Comparison x Value Update"/>
            <edc:SFRFieldDef edc:cname="CVMUPD" edc:nzwidth="0x1" edc:desc="Comparison x Value Mode Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CMP6PWM_CMPM" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnn---n" edc:impl="0xFFFFF1" edc:_addr="0x4801C198">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="CEN" edc:nzwidth="0x1" edc:desc="Comparison x Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTR" edc:nzwidth="0x4" edc:desc="Comparison x Trigger"/>
            <edc:SFRFieldDef edc:cname="CPR" edc:nzwidth="0x4" edc:desc="Comparison x Period"/>
            <edc:SFRFieldDef edc:cname="CPRCNT" edc:nzwidth="0x4" edc:desc="Comparison x Period Counter"/>
            <edc:SFRFieldDef edc:cname="CUPR" edc:nzwidth="0x4" edc:desc="Comparison x Update Period"/>
            <edc:SFRFieldDef edc:cname="CUPRCNT" edc:nzwidth="0x4" edc:desc="Comparison x Update Period Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CMP6PWM_CMPMUPD" edc:nzwidth="0x20" edc:access="------------wwww----wwwwwwww---w" edc:impl="0xF0FF1" edc:_addr="0x4801C19C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="CENUPD" edc:nzwidth="0x1" edc:desc="Comparison x Enable Update"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTRUPD" edc:nzwidth="0x4" edc:desc="Comparison x Trigger Update"/>
            <edc:SFRFieldDef edc:cname="CPRUPD" edc:nzwidth="0x4" edc:desc="Comparison x Period Update"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPRUPD" edc:nzwidth="0x4" edc:desc="Comparison x Update Period Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CMP7PWM_CMPV" edc:nzwidth="0x20" edc:access="-------nnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0x1FFFFFF" edc:_addr="0x4801C1A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="CV" edc:nzwidth="0x18" edc:desc="Comparison x Value"/>
            <edc:SFRFieldDef edc:cname="CVM" edc:nzwidth="0x1" edc:desc="Comparison x Value Mode">
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_INCREMENT" edc:desc="Compare when counter is incrementing" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_DECREMENT" edc:desc="Compare when counter is decrementing" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CMP7PWM_CMPVUPD" edc:nzwidth="0x20" edc:access="-------wwwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0x1FFFFFF" edc:_addr="0x4801C1A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="CVUPD" edc:nzwidth="0x18" edc:desc="Comparison x Value Update"/>
            <edc:SFRFieldDef edc:cname="CVMUPD" edc:nzwidth="0x1" edc:desc="Comparison x Value Mode Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CMP7PWM_CMPM" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnn---n" edc:impl="0xFFFFF1" edc:_addr="0x4801C1A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="CEN" edc:nzwidth="0x1" edc:desc="Comparison x Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTR" edc:nzwidth="0x4" edc:desc="Comparison x Trigger"/>
            <edc:SFRFieldDef edc:cname="CPR" edc:nzwidth="0x4" edc:desc="Comparison x Period"/>
            <edc:SFRFieldDef edc:cname="CPRCNT" edc:nzwidth="0x4" edc:desc="Comparison x Period Counter"/>
            <edc:SFRFieldDef edc:cname="CUPR" edc:nzwidth="0x4" edc:desc="Comparison x Update Period"/>
            <edc:SFRFieldDef edc:cname="CUPRCNT" edc:nzwidth="0x4" edc:desc="Comparison x Update Period Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CMP7PWM_CMPMUPD" edc:nzwidth="0x20" edc:access="------------wwww----wwwwwwww---w" edc:impl="0xF0FF1" edc:_addr="0x4801C1AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="CENUPD" edc:nzwidth="0x1" edc:desc="Comparison x Enable Update"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTRUPD" edc:nzwidth="0x4" edc:desc="Comparison x Trigger Update"/>
            <edc:SFRFieldDef edc:cname="CPRUPD" edc:nzwidth="0x4" edc:desc="Comparison x Period Update"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPRUPD" edc:nzwidth="0x4" edc:desc="Comparison x Update Period Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x50" edc:_addr="0x4801C1B0"/>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CH_NUM0PWM_CMR" edc:nzwidth="0x20" edc:access="------------nnnn--nnnnnn----nnnn" edc:impl="0xF3F0F" edc:_addr="0x4801C200">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="CPRE" edc:nzwidth="0x4" edc:desc="Channel Prescaler">
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Peripheral clock" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_2" edc:desc="Peripheral clock/2" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_4" edc:desc="Peripheral clock/4" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_8" edc:desc="Peripheral clock/8" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_16" edc:desc="Peripheral clock/16" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_32" edc:desc="Peripheral clock/32" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_64" edc:desc="Peripheral clock/64" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_128" edc:desc="Peripheral clock/128" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_256" edc:desc="Peripheral clock/256" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_512" edc:desc="Peripheral clock/512" edc:when="(field &amp; 0xF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_1024" edc:desc="Peripheral clock/1024" edc:when="(field &amp; 0xF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="CLKA" edc:desc="Clock A" edc:when="(field &amp; 0xF) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="CLKB" edc:desc="Clock B" edc:when="(field &amp; 0xF) == 0x0C"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CALG" edc:nzwidth="0x1" edc:desc="Channel Alignment">
              <edc:SFRFieldSemantic edc:cname="LEFT_ALIGNED" edc:desc="Left aligned" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CENTER_ALIGNED" edc:desc="Center aligned" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CPOL" edc:nzwidth="0x1" edc:desc="Channel Polarity">
              <edc:SFRFieldSemantic edc:cname="LOW_POLARITY" edc:desc="Waveform starts at low level" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_POLARITY" edc:desc="Waveform starts at high level" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CES" edc:nzwidth="0x1" edc:desc="Counter Event Selection">
              <edc:SFRFieldSemantic edc:cname="SINGLE_EVENT" edc:desc="At the end of PWM period" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DOUBLE_EVENT" edc:desc="At half of PWM period AND at the end of PWM period" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="UPDS" edc:nzwidth="0x1" edc:desc="Update Selection">
              <edc:SFRFieldSemantic edc:cname="UPDATE_AT_PERIOD" edc:desc="At the next end of PWM period" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="UPDATE_AT_HALF_PERIOD" edc:desc="At the next end of Half PWM period" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DPOLI" edc:nzwidth="0x1" edc:desc="Disabled Polarity Inverted"/>
            <edc:SFRFieldDef edc:cname="TCTS" edc:nzwidth="0x1" edc:desc="Timer Counter Trigger Selection"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DTE" edc:nzwidth="0x1" edc:desc="Dead-Time Generator Enable"/>
            <edc:SFRFieldDef edc:cname="DTHI" edc:nzwidth="0x1" edc:desc="Dead-Time PWMHx Output Inverted"/>
            <edc:SFRFieldDef edc:cname="DTLI" edc:nzwidth="0x1" edc:desc="Dead-Time PWMLx Output Inverted"/>
            <edc:SFRFieldDef edc:cname="PPM" edc:nzwidth="0x1" edc:desc="Push-Pull Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
