Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/edc/PIC32CX2051MTC128S1.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PB9" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="SEG12" edc:ppsfunction="A" ltx:memberofperipheral="SLCDC"/>
      <edc:VirtualPin edc:name="FLEXCOM3_IO0" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM3"/>
      <edc:VirtualPin edc:name="WKUP9" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB10" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="SEG13" edc:ppsfunction="A" ltx:memberofperipheral="SLCDC"/>
      <edc:VirtualPin edc:name="FLEXCOM3_IO1" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM3"/>
      <edc:VirtualPin edc:name="TRACESWO0" edc:ppsfunction="D" ltx:memberofperipheral="TPI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB11" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="SEG14" edc:ppsfunction="A" ltx:memberofperipheral="SLCDC"/>
      <edc:VirtualPin edc:name="FLEXCOM3_IO2" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM3"/>
      <edc:VirtualPin edc:name="FLEXCOM3_IO4" edc:ppsfunction="C" ltx:memberofperipheral="FLEXCOM3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB12" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="SEG15" edc:ppsfunction="A" ltx:memberofperipheral="SLCDC"/>
      <edc:VirtualPin edc:name="FLEXCOM3_IO3" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM3"/>
      <edc:VirtualPin edc:name="WKUP10" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB13" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="SEG16" edc:ppsfunction="A" ltx:memberofperipheral="SLCDC"/>
      <edc:VirtualPin edc:name="TIOB3" edc:ppsfunction="C" ltx:memberofperipheral="TC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB14" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="SEG17" edc:ppsfunction="A" ltx:memberofperipheral="SLCDC"/>
      <edc:VirtualPin edc:name="TCLK3" edc:ppsfunction="C" ltx:memberofperipheral="TC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB15" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="SEG18" edc:ppsfunction="A" ltx:memberofperipheral="SLCDC"/>
      <edc:VirtualPin edc:name="FLEXCOM5_IO4" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB16" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="SEG19" edc:ppsfunction="A" ltx:memberofperipheral="SLCDC"/>
      <edc:VirtualPin edc:name="FLEXCOM6_IO4" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB17" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="SEG20" edc:ppsfunction="A" ltx:memberofperipheral="SLCDC"/>
      <edc:VirtualPin edc:name="TCLK4" edc:ppsfunction="C" ltx:memberofperipheral="TC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB18" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="SEG21" edc:ppsfunction="A" ltx:memberofperipheral="SLCDC"/>
      <edc:VirtualPin edc:name="TIOA4" edc:ppsfunction="C" ltx:memberofperipheral="TC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB19" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="SEG22" edc:ppsfunction="A" ltx:memberofperipheral="SLCDC"/>
      <edc:VirtualPin edc:name="TIOB4" edc:ppsfunction="C" ltx:memberofperipheral="TC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB20" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="SEG23" edc:ppsfunction="A" ltx:memberofperipheral="SLCDC"/>
      <edc:VirtualPin edc:name="FLEXCOM5_IO0" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB21" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="SEG24" edc:ppsfunction="A" ltx:memberofperipheral="SLCDC"/>
      <edc:VirtualPin edc:name="FLEXCOM5_IO1" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB22" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="SEG25" edc:ppsfunction="A" ltx:memberofperipheral="SLCDC"/>
      <edc:VirtualPin edc:name="FLEXCOM5_IO2" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM5"/>
      <edc:VirtualPin edc:name="FLEXCOM5_IO4" edc:ppsfunction="C" ltx:memberofperipheral="FLEXCOM5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB23" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="SEG26" edc:ppsfunction="A" ltx:memberofperipheral="SLCDC"/>
      <edc:VirtualPin edc:name="FLEXCOM5_IO3" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB24" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="SEG27" edc:ppsfunction="A" ltx:memberofperipheral="SLCDC"/>
      <edc:VirtualPin edc:name="FLEXCOM4_IO0" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM4"/>
      <edc:VirtualPin edc:name="TIOA5" edc:ppsfunction="C" ltx:memberofperipheral="TC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB25" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="SEG28" edc:ppsfunction="A" ltx:memberofperipheral="SLCDC"/>
      <edc:VirtualPin edc:name="FLEXCOM4_IO1" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM4"/>
      <edc:VirtualPin edc:name="TIOB5" edc:ppsfunction="C" ltx:memberofperipheral="TC1"/>
      <edc:VirtualPin edc:name="WKUP8" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB26" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="SEG29" edc:ppsfunction="A" ltx:memberofperipheral="SLCDC"/>
      <edc:VirtualPin edc:name="FLEXCOM4_IO2" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM4"/>
      <edc:VirtualPin edc:name="FLEXCOM4_IO4" edc:ppsfunction="C" ltx:memberofperipheral="FLEXCOM4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC0" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="SEG30" edc:ppsfunction="A" ltx:memberofperipheral="SLCDC"/>
      <edc:VirtualPin edc:name="FLEXCOM4_IO3" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM4"/>
      <edc:VirtualPin edc:name="TIOA3" edc:ppsfunction="C" ltx:memberofperipheral="TC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC1" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="SEG31" edc:ppsfunction="A" ltx:memberofperipheral="SLCDC"/>
      <edc:VirtualPin edc:name="FLEXCOM4_IO4" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC2" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM1_IO0" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC3" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM1_IO1" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC4" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC5" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="A" ltx:memberofperipheral="PMC"/>
      <edc:VirtualPin edc:name="TCLK5" edc:ppsfunction="D" ltx:memberofperipheral="TC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC6" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM5_IO3" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM5"/>
      <edc:VirtualPin edc:name="FLEXCOM6_IO0" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC7" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM5_IO2" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM5"/>
      <edc:VirtualPin edc:name="FLEXCOM6_IO1" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM6"/>
      <edc:VirtualPin edc:name="FLEXCOM5_IO4" edc:ppsfunction="C" ltx:memberofperipheral="FLEXCOM5"/>
      <edc:VirtualPin edc:name="WKUP11" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC8" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM5_IO1" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC9" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM5_IO0" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM5"/>
      <edc:VirtualPin edc:name="WKUP12" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC10" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="QIO3" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC11" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="QIO2" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="FLEXCOM7_IO4" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC12" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="QIO1" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="FLEXCOM7_IO1" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC13" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="QIO0" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="FLEXCOM7_IO0" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC14" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="QCS" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="FLEXCOM7_IO3" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM7"/>
      <edc:VirtualPin edc:name="TIOA7" edc:ppsfunction="D" ltx:memberofperipheral="TC2"/>
      <edc:VirtualPin edc:name="WKUP13" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC15" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="QSCK" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="FLEXCOM7_IO2" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM7"/>
      <edc:VirtualPin edc:name="TIOB7" edc:ppsfunction="D" ltx:memberofperipheral="TC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC16" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM6_IO0" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM6"/>
      <edc:VirtualPin edc:name="TCLK7" edc:ppsfunction="D" ltx:memberofperipheral="TC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC17" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM6_IO1" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM6"/>
      <edc:VirtualPin edc:name="TIOA8" edc:ppsfunction="D" ltx:memberofperipheral="TC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC18" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM6_IO2" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM6"/>
      <edc:VirtualPin edc:name="FLEXCOM6_IO4" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM6"/>
      <edc:VirtualPin edc:name="TIOB8" edc:ppsfunction="D" ltx:memberofperipheral="TC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC19" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM6_IO3" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM6"/>
      <edc:VirtualPin edc:name="TCLK8" edc:ppsfunction="D" ltx:memberofperipheral="TC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC20" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM7_IO1" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC21" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM7_IO0" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM7"/>
      <edc:VirtualPin edc:name="WKUP14" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC22" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="PCK0" edc:ppsfunction="A" ltx:memberofperipheral="PMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD0" edc:ppsfunction="default" ltx:memberofperipheral="PIO1"/>
      <edc:VirtualPin edc:name="TIOA9" edc:ppsfunction="A" ltx:memberofperipheral="TC3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD1" edc:ppsfunction="default" ltx:memberofperipheral="PIO1"/>
      <edc:VirtualPin edc:name="URXD" edc:ppsfunction="A" ltx:memberofperipheral="UART"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD2" edc:ppsfunction="default" ltx:memberofperipheral="PIO1"/>
      <edc:VirtualPin edc:name="UTXD" edc:ppsfunction="A" ltx:memberofperipheral="UART"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD3" edc:ppsfunction="default" ltx:memberofperipheral="PIO1"/>
      <edc:VirtualPin edc:name="TCLK9" edc:ppsfunction="A" ltx:memberofperipheral="TC3"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="C" ltx:memberofperipheral="PWM"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD4" edc:ppsfunction="default" ltx:memberofperipheral="PIO1"/>
      <edc:VirtualPin edc:name="TIOB9" edc:ppsfunction="A" ltx:memberofperipheral="TC3"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="B" ltx:memberofperipheral="PMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD5" edc:ppsfunction="default" ltx:memberofperipheral="PIO1"/>
      <edc:VirtualPin edc:name="MCSPI_SPCK" edc:ppsfunction="A" ltx:memberofperipheral="MCSPI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD6" edc:ppsfunction="default" ltx:memberofperipheral="PIO1"/>
      <edc:VirtualPin edc:name="MCSPI_MISO" edc:ppsfunction="A" ltx:memberofperipheral="MCSPI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD7" edc:ppsfunction="default" ltx:memberofperipheral="PIO1"/>
      <edc:VirtualPin edc:name="MCSPI_MOSI0" edc:ppsfunction="A" ltx:memberofperipheral="MCSPI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD8" edc:ppsfunction="default" ltx:memberofperipheral="PIO1"/>
      <edc:VirtualPin edc:name="MCSPI_NPCS0" edc:ppsfunction="A" ltx:memberofperipheral="MCSPI"/>
      <edc:VirtualPin edc:name="MCSPI_MOSI1" edc:ppsfunction="B" ltx:memberofperipheral="MCSPI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD9" edc:ppsfunction="default" ltx:memberofperipheral="PIO1"/>
      <edc:VirtualPin edc:name="MCSPI_NPCS1" edc:ppsfunction="A" ltx:memberofperipheral="MCSPI"/>
      <edc:VirtualPin edc:name="MCSPI_MOSI2" edc:ppsfunction="B" ltx:memberofperipheral="MCSPI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD10" edc:ppsfunction="default" ltx:memberofperipheral="PIO1"/>
      <edc:VirtualPin edc:name="MCSPI_NPCS2" edc:ppsfunction="A" ltx:memberofperipheral="MCSPI"/>
      <edc:VirtualPin edc:name="MCSPI_MOSI3" edc:ppsfunction="B" ltx:memberofperipheral="MCSPI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD11" edc:ppsfunction="default" ltx:memberofperipheral="PIO1"/>
      <edc:VirtualPin edc:name="MCSPI_NPCS3" edc:ppsfunction="A" ltx:memberofperipheral="MCSPI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD12" edc:ppsfunction="default" ltx:memberofperipheral="PIO1"/>
      <edc:VirtualPin edc:name="URXD" edc:ppsfunction="A" ltx:memberofperipheral="UART"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD13" edc:ppsfunction="default" ltx:memberofperipheral="PIO1"/>
      <edc:VirtualPin edc:name="UTXD" edc:ppsfunction="A" ltx:memberofperipheral="UART"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD14" edc:ppsfunction="default" ltx:memberofperipheral="PIO1"/>
      <edc:VirtualPin edc:name="TIOA10" edc:ppsfunction="A" ltx:memberofperipheral="TC3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD15" edc:ppsfunction="default" ltx:memberofperipheral="PIO1"/>
      <edc:VirtualPin edc:name="TIOB10" edc:ppsfunction="A" ltx:memberofperipheral="TC3"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="B" ltx:memberofperipheral="PWM"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD16" edc:ppsfunction="default" ltx:memberofperipheral="PIO1"/>
      <edc:VirtualPin edc:name="TCLK10" edc:ppsfunction="A" ltx:memberofperipheral="TC3"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="B" ltx:memberofperipheral="PWM"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD17" edc:ppsfunction="default" ltx:memberofperipheral="PIO1"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="A" ltx:memberofperipheral="PWM"/>
      <edc:VirtualPin edc:name="TIOA11" edc:ppsfunction="C" ltx:memberofperipheral="TC3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD18" edc:ppsfunction="default" ltx:memberofperipheral="PIO1"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="A" ltx:memberofperipheral="PWM"/>
      <edc:VirtualPin edc:name="TIOB11" edc:ppsfunction="C" ltx:memberofperipheral="TC3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD19" edc:ppsfunction="default" ltx:memberofperipheral="PIO1"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="A" ltx:memberofperipheral="PWM"/>
      <edc:VirtualPin edc:name="TCLK11" edc:ppsfunction="C" ltx:memberofperipheral="TC3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NRST"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="FWUP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="JTAGSEL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="SHDN"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="TST"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RTCOUT0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="WKUP0_TMP0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="WKUP1_TMP1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="WKUP2_TMP2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="XOUT32"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="XIN32"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD3V3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VBAT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD3V3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD3V3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD3V3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD3V3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDPLL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDOUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD3V3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VREFP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDLCD"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
